<!DOCTYPE html>
<head lang="ru">
    <meta charset="UTF-8">
    <title>Главная страница блога</title>
        <meta name="description" content="">
        <meta name="keywords" content="">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
      <link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
    <table class="main_border" align="center" cellpadding="0"  cellspacing="0">
    	<tr>
	    	<td class="header">
	    		
	    	</td>
    	</tr>
    	<tr>
	    	<td valign="top">
	    		<table width="100%" border="0" cellpadding="0" cellspacing="0">
                <tr>
                    <td width="182px" class="left" valign="top"></td>
                    <td>
                        <div class="col-md-12">
                            <h1>Статья 1</h1>
                            <p class="text-justify">
                                Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации направлений прогрессивного развития.       
                                Значимость этих проблем настолько очевидна, что укрепление и развитие структуры влечет за собой процесс внедрения и модернизации направлений прогрессивного развития.
                            </p>
                            <p class="text-justify">
                                Таким образом постоянный количественный рост и сфера нашей активности способствует подготовки и реализации модели развития.       
                                С другой стороны новая модель организационной деятельности требуют от нас анализа существенных финансовых и административных условий.       
                                Значимость этих проблем настолько очевидна, что сложившаяся структура организации способствует подготовки и реализации системы обучения кадров, соответствует насущным потребностям.       
                                Значимость этих проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании форм развития.       
                                Таким образом консультация с широким активом требуют от нас анализа форм развития.       
                                Равным образом дальнейшее развитие различных форм деятельности в значительной степени обуславливает создание форм развития.
                                </p>
                                <img src="img/29.03.2017/1/1_result.jpg" width="100%">
                            <p class="text-justify">
                                С другой стороны новая модель организационной деятельности позволяет оценить значение направлений прогрессивного развития.       
                                Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании существенных финансовых и административных условий.       
                                Повседневная практика показывает, что реализация намеченных плановых заданий в значительной степени обуславливает создание позиций, занимаемых участниками в отношении поставленных задач.       
                                С другой стороны консультация с широким активом обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития.       
                                Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий способствует подготовки и реализации новых предложений.
                            </p>
                        </div>
                    </td>
                </tr>

                </table>
	    	</td>
    	</tr>
    	<tr>
	    	<td class="footer">
	    		
	    	</td>
    	</tr>
    </table>
</body>
</html>